# include "GM.h"

GM::GM()
{
}

void welcome()
{
        printf("\n\t\t\t\t欢迎使用学生管理系统\t\n");
        Sleep(1000);
        system("cls");
        printf("\n\t\t\t\t载入中\t\n");
        char bar[101];
        const char* lable = "|/-\\";
        memset(bar, '\0', sizeof(bar));
        int i = 0;
        while (i <= 100)
        {
            printf("[%-100s][%d%%][%c]\r", bar, i, lable[i % 4]);
            fflush(stdout);
            bar[i++] = '#';
            Sleep(10);
        }
        printf("\n");
        system("cls");
}
void GM::show()
{
	cout << "**************************************************************" << endl;
	cout << "**************    1.增加学生信息         *********************" << endl;
	cout << "**************    2.显示学生信息         *********************" << endl;
	cout << "**************    3.删除学生信息         *********************" << endl;
	cout << "**************    4.修改学生信息         *********************" << endl;
	cout << "**************    5.查找学生信息         *********************" << endl;
	cout << "**************    6.排序学生成绩         *********************" << endl;
	cout << "**************    7.清空所有信息         *********************" << endl;
    cout << "**************    0.退出管理系统         *********************" << endl;
	cout << "**************************************************************" << endl;
}

void GM:: exitos()
{
    cout <<" 欢迎下次使用 "<< endl;
    system("pause");
    exit(0);
}
GM::~GM()
{
}
