#include "wm.h"
wm::wm()
{
}

void wm::show_menu()
{
    char c;
    do
    {
        cout << "******************************************************" << endl;
        cout << "----------------欢迎使用学生成绩管理系统---------------" << endl;
        cout << "    *          【1】输入学生成绩                  *    " << endl;
        cout << "    *          【2】显示统计数据                  *    " << endl;
        cout << "    *          【3】查找学生成绩                  *    " << endl;
        cout << "    *          【4】修改学生成绩                  *    " << endl;
        cout << "    *          【5】删除学生成绩                  *    " << endl;
        cout << "    *          【6】插入学生成绩                  *    " << endl;
        cout << "    *          【7】按平均分排列                  *    " << endl;
        cout << "    *          【8】显示学生成绩                  *    " << endl;
        cout << "    *          【0】退出管理系统                  *    " << endl;
        cout << "******************************************************" << endl;
        cout << "请选择您的操作 (0-8):" << endl;
        c = getchar();
    } while (c < '0' || c > '8');
    cout<<endl;
}
wm::~wm()
{
}
